# prevent silent use of root access
system "sudo -k"

# don't install or remove official taps
Tap.all.filter{|x| x.official? && x.installed? && !x.core_tap?}.each{|x| tap x.name}
# install my tap
tap "rattatap/tap"

# cli tools
%w[bind jemalloc libidn2].each{|x| brew x, link: false}
brew "dos2unix"
brew "duti" # for setting mac file handlers
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git-delta"
brew "glow" # markdown
brew "hyperfine"
brew "jq"; brew "oniguruma", link: false
brew "less"
brew "neovim"; brew "luv"; brew "tree-sitter"
brew "ripgrep"
brew "tlrc" # tldr
brew "tmux"
brew "tree"
brew "typos-cli"
brew "unar"
brew "watch"
brew "xh" # http client
brew "zsh-completions"
brew "zstd"

# pgp
brew "pgpdump"
brew "sequoia-sq"
brew "sequoia-chameleon-gnupg"

# sysadmin
brew "awscli"; brew "saml2aws"
brew "cloudflare-cli4"
brew "rattatap/tap/fwknop-client"
brew "opentofu"
brew "sslscan"
brew "terraform"
brew "trivy"

# kubectl
brew "helm"
brew "k9s"
brew "kubecolor"
brew "kubectl-rook-ceph"
brew "kubelogin"
brew "kubernetes-cli"
brew "kubeseal"
brew "tanka"; brew "jsonnet"; brew "jsonnet-bundler"

# homebrew development
brew "actionlint"
brew "bash-completion"
brew "shellcheck", link: false
brew "shfmt", link: false

# dev
brew "gh"
brew "glab"
cask "hex-fiend"
cask "iterm2"
cask "ghostty", args: { no_bin: true }
brew "python"
brew "ruby", link: true

unless Hardware::CPU.virtualized?
  brew "mas"

  # text editors
  cask "textmate"

  # desktop env
  cask "1password"; cask "1password-cli"
  cask "betterdisplay"
  cask "discord"
  cask "firefox"
  cask "freecad"
  cask "omnidisksweeper"
  cask "pacifist"
  cask "skim"
  cask "slack"
  cask "swiftbar" # scripts in menubar
  cask "tower", args: { no_bin: true }
  mas "Dato", id: 1470584107
  mas "Deliveries", id: 290986013
  mas "Numbers", id: 409203825
  mas "Pages", id: 409201541
  mas "Wipr", id: 1662217862

  # misc tools
  mas "Mactracker", id: 430255202
  brew "ykman" # yubikey

  # vm
  brew "kind"
  %w[podman podman-compose].each{|x| brew x}
  cask "utm"

  # annoyances
  cask "notunes"

  # Install these casks manually. They require sudo, which we normally don't
  # want to allow.
  cask "kicad" if Cask::Caskroom.casks.find{|x| x.to_s == "kicad"}
  cask "xquartz" if Cask::Caskroom.casks.find{|x| x.to_s == "xquartz"}
end

# common dependencies
%w[gettext openssl@3 pcre2].each{|x| brew x, link: false}
